## Pandas Tutorial

In [1]:
import pandas as pd

In [2]:
data = {
    "name": ["Anuj", "Aayush", "Ratish", "Aensih", "Aayushya", "Sushil"],
    "age": [21, 22, 25, 23, 22, 27],
    "address": ["ktm", "bkt", "bkt", "ktm", "patan", "bkt"]
}

data

{'name': ['Anuj', 'Aayush', 'Ratish', 'Aensih', 'Aayushya', 'Sushil'],
 'age': [21, 22, 25, 23, 22, 27],
 'address': ['ktm', 'bkt', 'bkt', 'ktm', 'patan', 'bkt']}

In [3]:
df = pd.DataFrame(data)

df

       name  age address
0      Anuj   21     ktm
1    Aayush   22     bkt
2    Ratish   25     bkt
3    Aensih   23     ktm
4  Aayushya   22   patan
5    Sushil   27     bkt

In [4]:
df.head()

       name  age address
0      Anuj   21     ktm
1    Aayush   22     bkt
2    Ratish   25     bkt
3    Aensih   23     ktm
4  Aayushya   22   patan

In [5]:
df.tail()

       name  age address
1    Aayush   22     bkt
2    Ratish   25     bkt
3    Aensih   23     ktm
4  Aayushya   22   patan
5    Sushil   27     bkt

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   name     6 non-null      object
 1   age      6 non-null      int64
 2   address  6 non-null      object
dtypes: int64(1), object(2)
memory usage: 276.0+ bytes

In [8]:
df.describe()

             age
count   6.000000
mean   23.333333
std     2.250926
min    21.000000
25%    22.000000
50%    22.500000
75%    24.500000
max    27.000000

In [9]:
names = df["name"]
names

0        Anuj
1      Aayush
2      Ratish
3      Aensih
4    Aayushya
5      Sushil
Name: name, dtype: object

In [10]:
type(names)

pandas.core.series.Series

In [12]:
df_new = df[["name", "age"]]
df_new

       name  age
0      Anuj   21
1    Aayush   22
2    Ratish   25
3    Aensih   23
4  Aayushya   22
5    Sushil   27

In [13]:
df.columns

Index(['name', 'age', 'address'], dtype='object')

In [14]:
df["age"] + 5

0    26
1    27
2    30
3    28
4    27
5    32
Name: age, dtype: int64

In [16]:
df["age"] > 25

0    False
1    False
2    False
3    False
4    False
5     True
Name: age, dtype: bool

In [17]:
df[df["age"] > 25]

     name  age address
5  Sushil   27     bkt

In [20]:
df.loc[df["age"] > 25, ["name", "age"]]

     name  age
5  Sushil   27

In [24]:
df.iloc[0:3, 0:2]

     name  age
0    Anuj   21
1  Aayush   22
2  Ratish   25

In [25]:
df["age"].min()

np.int64(21)

In [26]:
df["age"].std()

np.float64(2.250925735484551)